/**
 * Created by Administrator on 2018/2/2.
 */
//const _pathApi='http://192.168.0.131:9015/';
const _pathApi='http://yy.eaqul.com:9021';
//正则验证
const myReg={
    mobile:/^(((13[0-9]{1})|(15[0-9]{1})|(18[0-9]{1}|(17[0-9]{1})))+\d{8})$/,  //验证手机号码
    yfloginpwd:/^[a-zA-Z](\w){5,20}$/,              //密码(字母开头，6-20位)
    url:/^(?:([A-Za-z]+):)?(\/{0,3})([0-9.\-A-Za-z]+)(?::(\d+))?(?:\/([^?#]*))?(?:\?([^#]*))?(?:#(.*))?$/,   //url地址
    number:/^[0-9]*$/,  //非负整数
    price:/(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/   //验证有1-2位小数的正实数
}